app/controllers/teachers_controller.rb

    def create
        # Receive nested hash from field_for in the view
        if Teacher.exists?(email: teacher_params[:email])
            redirect_to root_path, alert: "A user with this email already exists!"
        else
            if School.exists?(name: school_params[:name], city: school_params[:city], state: school_params[:state])
                @school = School.find_by(name: school_params[:name], city: school_params[:city], state: school_params[:state])
            else
                @school = School.new school_params
            end
            if !@school.save
                redirect_to root_path, alert: "An error occured! Please fill out the form fields correctly."
            else
                @teacher = @school.teachers.build teacher_params
                @teacher.validated = false
                if @teacher.save
---
SELECT  1 AS one FROM "teachers" WHERE "teachers"."email" = ? LIMIT 1  [["email", "murthy@berkeley.edu"]]
SELECT  1 AS one FROM "schools" WHERE "schools"."name" = ? AND "schools"."city" = ? AND "schools"."state" = ? LIMIT 1  [["name", "UC Berkeley"], ["city", "Berkeley"], ["state", "CA"]]
INSERT INTO "schools" ("name", "city", "state", "website", "lat", "lng") VALUES (?, ?, ?, ?, ?, ?)  [["name", "UC Berkeley"], ["city", "Berkeley"], ["state", "CA"], ["website", "www.berkeley.edu"], ["lat", 37.8715226], ["lng", -122.273042]]
UPDATE "schools" SET "teachers_count" = COALESCE("teachers_count", 0) + 1 WHERE "schools"."id" = ?  [["id", 1]]
INSERT INTO "teachers" ("encrypted_first_name", "encrypted_last_name", "encrypted_school_name", "encrypted_email", "encrypted_city", "encrypted_state", "encrypted_website", "encrypted_course", "encrypted_snap", "validated", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def validate
        if !@admin
            redirect_to root_path, alert: "Only administrators can validate!"
        else
            id = params[:id]
            teacher = Teacher.find_by(:id => id)
            teacher.validated = true
            teacher.school.num_validated_teachers += 1
            teacher.school.save!
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "schools" SET "num_validated_teachers" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["num_validated_teachers", 1], ["updated_at", "2019-12-13 01:37:02.557455"], ["id", 1]]
UPDATE "teachers" SET "validated" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["validated", "t"], ["updated_at", "2019-12-03 07:34:46.636242"], ["id", 1]]

    def all
        if !@admin
            redirect_to root_path, alert: "Only administrators can view all forms!"
        else
            @validated_teachers = Teacher.where(validated: true)
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."validated" = ?  [["validated", "t"]]