app/controllers/teachers_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
  def load_school
    if teacher_params[:school_id].present?
      @school ||= School.find(teacher_params[:school_id])